FI/06_Test_Results/StRes6/Report/Data/Step3.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">CreateFlightOrder</td><td class="value col-head-style">StServiceCallActivity9</td><td class="value col-head-style">Failure</td><td class="value col-head-style">The server has returned a soap fault</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity9_InputXml_96ba6f84-7980-4785-8f67-c6e7535ee3ef.xml\', \'Data/StServiceCallActivity9_InputXml_96ba6f84-7980-4785-8f67-c6e7535ee3ef.js4hrpt\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n  &lt;Body&gt;\r\n    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;FlightOrder&gt;\r\n        &lt;Class&gt;Economy&lt;/Class&gt;\r\n        &lt;CustomerName&gt;Christopher&lt;/CustomerName&gt;\r\n        &lt;DepartureDate&gt;2020-06-29T00:00:00&lt;/DepartureDate&gt;\r\n        &lt;FlightNumber&gt;1042&lt;/FlightNumber&gt;\r\n        &lt;NumberOfTickets&gt;2&lt;/NumberOfTickets&gt;\r\n      &lt;/FlightOrder&gt;\r\n    &lt;/CreateFlightOrder&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">CreateFlightOrder</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity9_Full_request_ae4f9287-ea71-4db2-84cc-436e05d9bc92.xml\', \'Data/StServiceCallActivity9_Full_request_ae4f9287-ea71-4db2-84cc-436e05d9bc92.js4hrpt\', \'.xml\', \'Full request\');return false;">&lt;Envelope xmlns="htt ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	498\nExpect:	100-continue\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	227\nContent-Type:	text/xml; charset=utf-8\nDate:	Thu, 09 Jul 2020 08:14:37 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;s:Fault&gt;&lt;faultcode&gt;s:Client&lt;/faultcode&gt;&lt;faultstring xml:lang="en-US"&gt;Specify a flight date later than today.&lt;/faultstring&gt;&lt;/s:Fault&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">500 : InternalServerError</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity9_OutputXml_3cc092b0-af4c-4fa5-8ed3-137f432dee66.xml\', \'Data/StServiceCallActivity9_OutputXml_3cc092b0-af4c-4fa5-8ed3-137f432dee66.js4hrpt\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;s:Fault&gt;\r\n      &lt;faultcode&gt;s:Client&lt;/faultcode&gt;\r\n      &lt;faultstring xml:lang="en-US"&gt;Specify a flight date later than today.&lt;/faultstring&gt;\r\n    &lt;/s:Fault&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Details</td><td class="value row-head-style">CreateFlightOrder ended unsuccessfully</td></tr> </table></div></div>';}